content-org/blog.org
;; -*- mode: Org; org-download-image-dir: "../static/images/posts"; org-download-heading-lvl: 1; org-download-display-inline-images: nil; org-download-timestamp: "" -*-

#+TITLE: Posts
#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: blog
#+SEQ_TODO: TODO DONE
#+PROPERTY: header-args :eval never-export
#+OPTIONS: creator:t toc:nil

** DONE Rethinking Twitter :good:
CLOSED: [2019-05-15 Wed 17:51]
:PROPERTIES:
:EXPORT_FILE_NAME: rethinking-twitter
:END:

*** Good old days

Twitter is the only social media I've ever used. Sure, I had accounts on other sites, but was never really engaged elsewhere. I couldn't understand all those "facebook addiction" stories, honestly. Facebook was always extremely boring, while Twitter was always exciting.

From the beginning, it was a perfect, geeky, simple thing that is kind of hard to explain. Just a stream of short thoughts. Cool links. One liners. A public chat room.

I joined Twitter in 2007. Woah, 12 years ago! I was studying in a university, and smartphones weren't really a thing yet. This is totally a "back in my days" kind of rhetoric, but hell, that Twitter was nice.

Most people didn't have a Twitter account. Because it's weird, what's the point? So, like other internet communities, Twitter started as a selected group of weirdos, acting constantly amazed about the fact that they're all here. Tweeting.

The timeline was chronological, and the world seemed ordered. It was more like RSS than like Facebook or TV: you could only see the people you explicitly subscribed to. Never an unknown face in your timeline. Retweets weren't a feature, it was just a thing people did: copying a tweet and putting "RT" in front of it. I think it's a better strategy overall: if you retweet something this way, you put your face on the message, you own it now. So, the value of retweets was higher, nobody wanted to copy every mildly interesting thing.

There were no likes, this added sugar of engagement and interaction. You like something? Well, say it. Tell it to the author, do a retweet with an encouraging comment. Do something you'd do in real life.

Twitter was allowing people to communicate via a digital medium. Not communicate in a new digital way.

And Twitter wasn't like TV.

*** Outsourced schizophrenia

A HackerNews user had [[https://news.ycombinator.com/item?id=16292024][put]] it nicely:

#+BEGIN_QUOTE
I think the problem is that Twitter is a platform for evolutionary selection of slogan-based-dialog. I kind of imagine two armies standing across a battlefield from one another carefully deciding which volley of pithy digs to throw at one another.
#+END_QUOTE

Yeah. It's like switching TV channels every 5 seconds.

[[https://adambrault.com/blog/i-quit-twitter-for-a-month][This article]] had hit home hard for me. I'll just include a few quotes:

#+BEGIN_QUOTE
There are people you know whose voice you can hear in your head [...], or people who you even consult with in your head for wisdom ("What advice would my dad give here?") [...]

...it can be a huge mental lease we're signing when we invite a few hundred people into our Twitter life. To some degree, it is choosing to subject ourselves to thousands of ads throughout the day, but ones that come from trusted sources we care about, so they're actually impactful.
#+END_QUOTE

Yes! And especially today, thanks to both natural and artificial (algorithmic) selection, these short ads are hyper-optimized for stickiness and virality.

#+BEGIN_QUOTE
We've surrendered a massive amount of mental and emotional energy without making the explicit choice to do so--it's simply imposed on us by subscribing to the channel and checking it.
#+END_QUOTE

The worst part is that nowadays you see a chaotic stream from people you /haven't/ explicitly subscribed to: retweets, liked and promoted tweets, ads, etc.

#+BEGIN_QUOTE
Mentally, we just aren't capable of simultaneously empathizing with hundreds of people--let alone thousands or millions. The result is we either build up a calloused, jaded, or cynical defense against empathy or find a way to block out more.
#+END_QUOTE

I can hardly manage interacting with a single person for more than a few hours, let alone with hundreds, even via virtual channels.

This one describes me very well too:

#+BEGIN_QUOTE
I'll admit: I'm an annoyingly oversensitive person. I do believe this is both a strength and a weakeness. [...] I also have a tendency to listen carefully to any criticism or disagreement I hear, internalize it, reflect on it, and evaluate it, then conclude some thought on it. Until I do that, it just sort of hangs there in my head. The degree to which it dominates my headspace is largely a question of how much it impacts me.
#+END_QUOTE

If nothing else, I want you to consider this quote:

#+BEGIN_QUOTE
[...] Twitter is outsourced schizophrenia. I have a couple hundred voices I have consensually agreed to allow residence inside my brain.
#+END_QUOTE

I assume not everyone is like that, and not everyone experiences social media this way. But Adam, the author of that post, does. I do too.

His essay is fantastic, really:

#+BEGIN_QUOTE
I've realized how Twitter has made me break up my thoughts into tiny, incomplete, pieces--lots of hanging ideas, lots of incomplete relationships, punctuated by all manner of hanging threads and half-forked paths.
#+END_QUOTE

*** Change

But Twitter has been very beneficial to my career. With a few thousand followers, links to my projects had consistently brought me hundreds of hits, readers, clients. This is my strategic failure: I haven't been working on maintaining an independent outlet for my audience, a newsletter or a consistent blog. For more than a decade, Twitter has been the main channel of distributing my work.

So, I decided to make a few changes and conduct an experiment.

1. Unfollow everybody. No more timeline.
2. Tweet via an app like Buffer, without opening Twitter itself.
3. Open Twitter and reply to mentions only on weekends.
4. Invest energy into maintaining a consistent blog and a personal newsletter. You can subscribe to the newsletter [[https://buttondown.email/rakhim][here]] or with a form below:

#+BEGIN_export html
<form
  action="https://buttondown.email/api/emails/embed-subscribe/rakhim"
  method="post"
  target="popupwindow"
  onsubmit="window.open('https://buttondown.email/rakhim', 'popupwindow')"
  class="embeddable-buttondown-form"
>
  <label for="bd-email">Enter your email</label>
  <input type="email" name="email" id="bd-email">
  <input type="hidden" value="1" name="embed"/>
  <input type="submit" value="Subscribe" />
</form>
#+END_export

I will maintain this system at least until the end of 2019 and we'll see how it goes.

TWEET THIS NOW!
